app/views/articles/_article.html.haml

      - if show_project
        - article.projects.each do |p|
---
SELECT "projects".* FROM "projects" INNER JOIN "project_articles" ON "projects"."id" = "project_articles"."project_id" WHERE "project_articles"."article_id" = 121