app/controllers/home_controller.rb

  def index
    @articles = BlogArticle
      .all(:include => :article)
      .map{ |ba| ba.article }
      .sort_by{ |article| article.date }
      .reverse
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" IN (6, 7) ORDER BY date DESC